doi-utils.org
** ECS
#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun ecs-pdf-url (*doi-utils-redirect*)
  (when (string-match "^http://jes.ecsdl.org" *doi-utils-redirect*)
    (replace-regexp-in-string "\.abstract$" ".full.pdf" *doi-utils-redirect*)))
#+END_SRC

http://ecst.ecsdl.org/content/25/2/2769
http://ecst.ecsdl.org/content/25/2/2769.full.pdf

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun ecst-pdf-url (*doi-utils-redirect*)
  (when (string-match "^http://ecst.ecsdl.org" *doi-utils-redirect*)
    (concat *doi-utils-redirect* ".full.pdf")))
#+END_SRC


** RSC
#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun rsc-pdf-url (*doi-utils-redirect*)
  (when (string-match "^http://pubs.rsc.org" *doi-utils-redirect*)
    (let ((url (downcase *doi-utils-redirect*)))
      (setq url (replace-regexp-in-string "articlelanding" "articlepdf" url))
      url)))
#+END_SRC

** Elsevier/ScienceDirect
You cannot compute these pdf links; they are embedded in the redirected pages.

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defvar *doi-utils-pdf-url* nil
  "stores url to pdf download from a callback function")

(defun doi-utils-get-science-direct-pdf-url (redirect-url)
  "science direct hides the pdf url in html. we get it out here"
  (setq *doi-utils-waiting* t)
  (url-retrieve redirect-url
		(lambda (status)
		  (beginning-of-buffer)
		  (re-search-forward "pdfurl=\"\\([^\"]*\\)\"" nil t)
		  (setq *doi-utils-pdf-url* (match-string 1)
			,*doi-utils-waiting* nil)))
  (while *doi-utils-waiting* (sleep-for 0.1))
  ,*doi-utils-pdf-url*)


(defun science-direct-pdf-url (*doi-utils-redirect*)
  (when (string-match "^http://www.sciencedirect.com" *doi-utils-redirect*)
    (doi-utils-get-science-direct-pdf-url *doi-utils-redirect*)
    ,*doi-utils-pdf-url*))

;; sometimes I get
;; http://linkinghub.elsevier.com/retrieve/pii/S0927025609004558
;; which actually redirect to
;; http://www.sciencedirect.com/science/article/pii/S0927025609004558
(defun linkinghub-elsevier-pdf-url (*doi-utils-redirect*)
  (when (string-match "^http://linkinghub.elsevier.com/retrieve" *doi-utils-redirect*)
    (let ((second-redirect (replace-regexp-in-string
			    "http://linkinghub.elsevier.com/retrieve"
			    "http://www.sciencedirect.com/science/article"
			    ,*doi-utils-redirect*)))
      (message "getting pdf url from %s" second-redirect)
      ;(doi-utils-get-science-direct-pdf-url second-redirect)
      ,*doi-utils-pdf-url*)))
#+END_SRC

** PNAS
http://www.pnas.org/content/early/2014/05/08/1319030111
http://www.pnas.org/content/early/2014/05/08/1319030111.full.pdf

with supporting info
http://www.pnas.org/content/early/2014/05/08/1319030111.full.pdf+html?with-ds=yes
#+BEGIN_SRC emacs-lisp  :tangle doi-utils.el
(defun pnas-pdf-url (*doi-utils-redirect*)
  (when (string-match "^http://www.pnas.org" *doi-utils-redirect*)
    (concat *doi-utils-redirect* ".full.pdf?with-ds=yes")))
#+END_SRC

** Add all functions
#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(setq doi-utils-pdf-url-functions
      (list
       'aps-pdf-url
       'science-pdf-url
       'nature-pdf-url
       'wiley-pdf-url	     
       'springer-pdf-url
       'acs-pdf-url
       'iop-pdf-url
       'jstor-pdf-url
       'aip-pdf-url
       'science-direct-pdf-url
       'linkinghub-elsevier-pdf-url
       'tandfonline-pdf-url
       'ecs-pdf-url
       'ecst-pdf-url
       'rsc-pdf-url
       'pnas-pdf-url))
#+END_SRC

** Get the pdf url for a doi
#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun doi-utils-get-pdf-url (doi)
  "returns a url to a pdf for the doi if one can be
calculated. Loops through the functions in `doi-utils-pdf-url-functions'
until one is found"
  (doi-utils-get-redirect doi)
  
  (unless *doi-utils-redirect*
    (error "No redirect found for %s" doi))
  (message "applying functions")
  (catch 'pdf-url
    (dolist (func doi-utils-pdf-url-functions)
     (message "calling %s" func)
      (let ((this-pdf-url (funcall func *doi-utils-redirect*)))
(message "t: %s" this-pdf-url)
	(when this-pdf-url
          (message "found pdf url: %s" this-pdf-url)
	  (throw 'pdf-url this-pdf-url))))))
#+END_SRC

#+RESULTS:
: doi-utils-get-pdf-url


#+BEGIN_SRC emacs-lisp
(doi-utils-get-pdf-url "10.1126/science.1158722")
#+END_SRC

#+RESULTS:
: http://www.sciencemag.org/content/321/5890/792.full.pdf

#+BEGIN_SRC emacs-lisp
(doi-utils-get-pdf-url  "10.1021/nl500037x")
#+END_SRC

#+RESULTS:
: http://pubs.acs.org/doi/pdf/10.1021/nl500037x


#+BEGIN_SRC emacs-lisp
(doi-utils-get-pdf-url  "10.1002/anie.201402680")
#+END_SRC

#+RESULTS:
: http://onlinelibrary.wiley.com/doi/10.1002/anie.201402680/pdf

** Finally, download the pdf
#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun doi-utils-get-bibtex-entry-pdf ()
  "download pdf for entry at point if the pdf does not already
exist locally. The entry must have a doi. The pdf will be saved
to `org-ref-pdf-directory', by the name %s.pdf where %s is the
bibtex label. Files will not be overwritten. The pdf will be
checked to make sure it is a pdf, and not some html failure
page. you must have permission to access the pdf. We open the pdf
at the end."
  (interactive)
  (save-excursion
    (bibtex-beginning-of-entry) 
    (let (;; get doi, removing http://dx.doi.org/ if it is there.
	  (doi (replace-regexp-in-string
		"http://dx.doi.org/" ""
		(bibtex-autokey-get-field "doi")))	       
	  (key)
	  (pdf-url)
	  (pdf-file)
	  (content))
      ;; get the key and build pdf filename.
      (re-search-forward bibtex-entry-maybe-empty-head)
      (setq key (match-string bibtex-key-in-head))
      (setq pdf-file (concat org-ref-pdf-directory key ".pdf"))

      ;; now get file if needed.
      (when (and doi (not (file-exists-p pdf-file)))
	(setq pdf-url (doi-utils-get-pdf-url doi))
	(if pdf-url
	    (progn
	      (url-copy-file pdf-url pdf-file)
	      ;; now check if we got a pdf
	      (with-temp-buffer
		(insert-file-contents pdf-file)
		;; PDFS start with %PDF-1.x as the first few characters.
		(if (not (string= (buffer-substring 1 6) "%PDF-"))
		    (progn
		      (message "%s" (buffer-string))
		      (delete-file pdf-file))
		  (message "%s saved" pdf-file)))
	
	      (when (file-exists-p pdf-file)
		(org-open-file pdf-file)))
	  (message "No pdf-url found for %s at %s" doi *doi-utils-redirect* ))
	  pdf-file))))
#+END_SRC

