doi-utils.org
* Getting bibtex entries from a DOI

I [[http://homepages.see.leeds.ac.uk/~eeaol/notes/2013/02/doi-metadata/][found]] you can download metadata about a DOI from http://dx.doi.org. You just have to construct the right http request to get it. Here is a function that gets the metadata as a plist in emacs.

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun doi-utils-get-json-metadata (doi)
  (let ((url-request-method "GET") 
       (url-mime-accept-string "application/citeproc+json")
       (json-object-type 'plist))
    (with-current-buffer
	(url-retrieve-synchronously
	 (concat "http://dx.doi.org/" doi))
      (json-read-from-string (buffer-substring url-http-end-of-headers (point-max))))))       
#+END_SRC

#+RESULTS:
: doi-utils-get-json-metadata

For example:
#+BEGIN_SRC emacs-lisp
(doi-utils-get-json-metadata "10.1103/PhysRevLett.99.016105")
#+END_SRC

#+RESULTS:
| :volume | 99 | :indexed | (:timestamp 1399964115538.0 :date-parts [[2014 5 13]]) | :publisher | American Physical Society (APS) | :source | CrossRef | :URL | http://dx.doi.org/10.1103/PhysRevLett.99.016105 | :ISSN | [0031-9007 1079-7114] | :DOI | 10.1103/physrevlett.99.016105 | :type | journal-article | :title | Scaling Properties of Adsorption Energies for Hydrogen-Containing Molecules on Transition-Metal Surfaces | :issue | 1 | :deposited | (:timestamp 1313712000000.0 :date-parts [[2011 8 19]]) | :reference-count | 26 | :container-title | Phys. Rev. Lett. | :author | [(:given F. :family Abild-Pedersen) (:given J. :family Greeley) (:given F. :family Studt) (:given J. :family Rossmeisl) (:given T. :family Munter) (:given P. :family Moses) (:given E. :family Skúlason) (:given T. :family Bligaard) (:given J. :family Nørskov)] | :prefix | http://id.crossref.org/prefix/10.1103 | :score | 1.0 | :issued | (:date-parts [[2007 7]]) | :subject | [Physics and Astronomy(all)] | :subtitle | [] |

We can use that data to construct a bibtex entry. We do that by defining a template, and filling it in. I wrote this template expansion code which makes it easy to substitute values like %{} in emacs lisp.

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun doi-utils-expand-template (s)
  "expand a template containing %{} with the eval of its contents"
  (replace-regexp-in-string "%{\\([^}]+\\)}"
                            (lambda (arg)
                              (let ((sexp (substring arg 2 -1)))
                                (format "%s" (eval (read sexp))))) s))
#+END_SRC

Now we define a function that fills in that template from the metadata.

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun doi-utils-doi-to-bibtex-string (doi)
  "return a bibtex entry as a string for the doi. Only articles are currently supported"
  (let (type
	results
	author
	title
	journal
	year
	volume
	number
	pages
	month
	url
	json-data)
    (setq results (doi-utils-get-json-metadata doi)
	  json-data (format "%s" results)
	  type (plist-get results :type)
	  author (mapconcat (lambda (x) (concat (plist-get x :given) " " (plist-get x :family)))
			    (plist-get results :author) " and ")
	  title (plist-get results :title)
	  journal (plist-get results :container-title)
	  volume (plist-get results :volume)
	  issue (plist-get results :issue)
	  year (elt (elt (plist-get (plist-get results :issued) :date-parts) 0) 0)
	  pages (plist-get results :page)
	  doi (plist-get results :DOI)
	  url (plist-get results :URL))
    (cond
     ((string= type "journal-article")
      (doi-utils-expand-template "@article{,
  author = 	 {%{author}},
  title = 	 {%{title}},
  journal = 	 {%{journal}},
  year = 	 {%{year}},
  volume = 	 {%{volume}},
  number = 	 {%{issue}},
  pages = 	 {%{pages}},
  doi =          {%{doi}},
  url =          {%{url}},
}"))
    (t (message-box "%s not supported yet." type)))))
#+END_SRC

#+RESULTS:
: doi-utils-doi-to-bibtex-string

To see that in action:
#+BEGIN_SRC emacs-lisp
(doi-utils-doi-to-bibtex-string "10.1103/PhysRevLett.99.016105")
#+END_SRC

#+RESULTS:
#+begin_example
@article{,
  author = 	 {F. Abild-Pedersen and J. Greeley and F. Studt and J. Rossmeisl and T. Munter and P. Moses and E. Skúlason and T. Bligaard and J. Nørskov},
  title = 	 {Scaling Properties of Adsorption Energies for Hydrogen-Containing Molecules on Transition-Metal Surfaces},
  journal = 	 {Phys. Rev. Lett.},
  year = 	 {2007},
  volume = 	 {99},
  number = 	 {1},
  pages = 	 {nil},
  doi =          {10.1103/physrevlett.99.016105},
  url =          {http://dx.doi.org/10.1103/PhysRevLett.99.016105},
}
#+end_example

That is just the string for the entry. To be useful, we need a function that inserts the string into a buffer. This function will insert the string at the cursor, clean the entry, try to get the pdf, and create a notes entry for you.

#+BEGIN_SRC emacs-lisp  :tangle doi-utils.el
(defun doi-utils-insert-bibtex-entry-from-doi (doi)
  "insert bibtex entry from a doi. Also cleans entry using
org-ref, and tries to download the corresponding pdf."
  (interactive "sDOI: ")
  (insert (doi-utils-doi-to-bibtex-string doi))
  (backward-char)
  (if (bibtex-key-in-head nil)
       (org-ref-clean-bibtex-entry t)
     (org-ref-clean-bibtex-entry))
   ;; try to get pdf
   (doi-utils-get-bibtex-entry-pdf)
   (save-selected-window
     (org-ref-open-bibtex-notes)))
#+END_SRC

It may be you are in some other place when you want to add a bibtex entry. This next function will open the first entry in org-ref-default-bibliography go to the end, and add the entry. You can sort it later.

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun doi-utils-add-bibtex-entry-from-doi (doi)
  "add entry to end of first entry in `org-ref-default-bibliography'."
  (interactive "sDOI: ")
  (find-file (car org-ref-default-bibliography))
  (end-of-buffer)
  (insert "\n\n")
  (doi-utils-insert-bibtex-entry-from-doi doi))
#+END_SRC

It may be you want to just highlight a doi, and then add it. Here is that function.

#+BEGIN_SRC emacs-lisp  :tangle doi-utils.el
(defun doi-utils-add-bibtex-entry-from-region (start end)
  "add entry assuming region is a doi to end of first entry in `org-ref-default-bibliography'."
  (interactive "r")
  (let ((doi (buffer-substring start end)))
    (find-file (car org-ref-default-bibliography))
    (end-of-buffer)
    (insert "\n")
    (doi-utils-insert-bibtex-entry-from-doi doi)))
#+END_SRC

#+RESULTS:
: doi-utils-add-bibtex-entry-from-region

* Updating bibtex entries
I wrote this code because it is pretty common for me to copy bibtex entries from ASAP articles that are incomplete, e.g. no page numbers because it is not in print yet. I wanted a convenient way to update an entry from its DOI. Basically, we get the metadata, and update the fields in the entry.

There is not bibtex set field function, so I wrote this one.

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun bibtex-set-field (field value)
  "set field to value in bibtex file. create field if it does not exist"
  (interactive "sfield: \nsvalue: ")
  (bibtex-beginning-of-entry)
  (let ((found))
    (if (setq found (bibtex-search-forward-field field t))
	;; we found a field
	(progn
	  (goto-char (car (cdr found)))
	  (when value
	    (bibtex-kill-field)
	    (bibtex-make-field field)
	    (backward-char)
	    (insert value)))
      ;; make a new field
      (message "new field being made")
      (bibtex-beginning-of-entry)
      (forward-line) (beginning-of-line)
      (bibtex-next-field nil)
      (forward-char)
      (bibtex-make-field field)
      (backward-char)
      (insert value))))
#+END_SRC

The updating function looks like this. We get all the keys from the json plist metadata, and update the fields if they exist.

#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(defun plist-get-keys (plist)
   "return keys in a plist"
  (loop
   for key in results by #'cddr collect key))

(defun doi-utils-update-bibtex-entry-from-doi (doi)
  "update fields in a bibtex entry from the doi. Every field will be updated, so previous changes will be lost."
  (interactive (list
		(or (replace-regexp-in-string "http://dx.doi.org/" "" (bibtex-autokey-get-field "doi"))
		    (read-string "DOI: "))))
  (let* ((results (doi-utils-get-json-metadata doi))
	 (type (plist-get results :type))
	 (author (mapconcat
		  (lambda (x) (concat (plist-get x :given)
				    " " (plist-get x :family)))
		  (plist-get results :author) " and "))
	 (title (plist-get results :title))
	 (journal (plist-get results :container-title))
	 (year (format "%s"
		       (elt
			(elt
			 (plist-get
			  (plist-get results :issued) :date-parts) 0) 0)))	
	(volume (plist-get results :volume))
	(number (or (plist-get results :issue) ""))
	(pages (or (plist-get results :page) ""))
	(url (or (plist-get results :URL) ""))
	(doi (plist-get results :DOI)))
    
    ;; map the json fields to bibtex fields. The code each field is mapped to is evaluated.
    (setq mapping '((:author . (bibtex-set-field "author" author))
		    (:title . (bibtex-set-field "title" title))
		    (:container-title . (bibtex-set-field "journal" journal))
		    (:issued . (bibtex-set-field "year" year))
		    (:volume . (bibtex-set-field "volume" volume))
		    (:issue . (bibtex-set-field "number" number))
		    (:page . (bibtex-set-field "pages" pages))
		    (:DOI . (bibtex-set-field "doi" doi))
		    (:URL . (bibtex-set-field "url" url))))

    ;; now we have code to run for each entry. we map over them and evaluate the code
    (mapcar
     (lambda (key)
       (eval (cdr (assoc key mapping))))
     (plist-get-keys results)))
  
  ; reclean entry, but keep key if it exists.
  (if (bibtex-key-in-head)
      (org-ref-clean-bibtex-entry t)
    (org-ref-clean-bibtex-entry)))
#+END_SRC
* end of file
#+BEGIN_SRC emacs-lisp :tangle doi-utils.el
(provide 'doi-utils)
#+END_SRC
* load
#+BEGIN_SRC emacs-lisp
(org-babel-load-file "doi-utils.org")
#+END_SRC

#+RESULTS:
: Loaded doi-utils.el

